{
    "datapack.commands.createFile.title": "Créer un fichier",
    "datapack.commands.evaludateJavaScript.title": "Évaluer un extrait de code JavaScript",
    "datapack.commands.redownloadData.title": "Re-télécharger les données d'achèvement",
    "datapack.commands.regenerateCache.title": "Regénèrer le cache",
    "datapack.config.env.cmdVersion": "La version de l'arbre de commandes. Seules les versions majeures sont disponibles.",
    "datapack.config.env.dataSource": "La source de téléchargement des données d'achèvement. Nous recommandons de choisir GitHub, à moins que raw.githubusercontent.com soit bloqué dans votre pays/région.",
    "datapack.config.env.dataVersion": "La version des données de complétion, incluant les registres, les définitions de blocs et le nbtdoc. Devrait être une identité dans le [version manifest](https://launchermeta.mojang.com/mc/game/version_manifest.json) qui a été publiée après la `19w40a`. À part l'identité de version, vous pouvez aussi entrer `Latest release` ou `Latest snapshot` ici (insensible à la casse).",
    "datapack.config.env.defaultVisibility": "le modificateur d'accès par défaut aux ressources.",
    "datapack.config.env.dependsOnVanilla": "Si ce pack de données dépend du pack de données vanilla ou non. Si cette option est activée, des complétions des données correspondantes du pack de données vanilla seront fournies.",
    "datapack.config.env.detectionDepth": "La profondeur du système de fichiers pour la détection de la racine des packs de données.",
    "datapack.config.env.exclude": "Les fichiers qui devraient être exclus de la validation. Chaque chaîne de caractères dans ce tableau sera interprété comme un motif \"glob\" pour tester les chemins de fichier relatifs à partir de la racine du pack de données.",
    "datapack.config.env.include": "Les fichiers qui devraient être inclus dans la validation. Chaque chaîne de caractères dans ce tableau sera interprété comme un motif \"glob\" pour tester les chemins de fichier relatifs à partir de la racine du pack de données.\nCette option est prioritaire à `exclude`.",
    "datapack.config.env.jsonVersion": "La version des schémas JSON. Seules les versions majeures sont disponibles.",
    "datapack.config.env.language": "La langue dans laquelle les messages fournis par le language server devraient apparaître.",
    "datapack.config.env.permissionLevel": "`function-permission-level` défini dans `server.properties`.",
    "datapack.config.features.codeActions": "Si DHP devrait fournir des actions de code ou non.",
    "datapack.config.features.colors": "Si DHP devrait fournir des soutiens couleur ou non.",
    "datapack.config.features.completions": "Si DHP devraient fournir des complétions ou non.",
    "datapack.config.features.documentHighlighting": "Si DHP devraient fournir une coloration syntaxique des documents ou non.",
    "datapack.config.features.documentLinks": "Si DHP devrait fournir des liens vers les documents ou non.",
    "datapack.config.features.formatting": "Si DHP devrait fournir des fonctionnalités de formatage ou non.",
    "datapack.config.features.hover": "Si DHP devrait fournir de l'information lors du survol ou non.",
    "datapack.config.features.selectionRanges": "Si DHP devrait fournir des intervalles de sélection ou non.",
    "datapack.config.features.semanticColoring": "Si DHP devrait fournir une coloration sémantique ou non.",
    "datapack.config.features.signatures": "Si DHP devrait fournir des informations de signature pour les commandes ou non.",
    "datapack.config.lint.blockStateBracketSpacing": "Imposer un espacement entre les crochets des états de bloc.",
    "datapack.config.lint.blockStateCommaSpacing": "Imposer un espacement autour des virgules dans les états de bloc. Indépendamment des paramètres, les espaces après les virgules finales sont toujours supprimés.",
    "datapack.config.lint.blockStateEqualSpacing": "Imposer l'espacement autour des signes égal dans les états de bloc.",
    "datapack.config.lint.blockStateSortKeys": "Si les différentes clés sont triées dans les blockstates ou non.",
    "datapack.config.lint.blockStateTrailingComma": "Si il devrait y avoir une virgule après la dernière paire clé-valeur dans les états de bloc ou non.",
    "datapack.config.lint.eol": "Imposer le caractère de fin de ligne (EOL) dans les fichiers `mcfunction`.",
    "datapack.config.lint.idOmitDefaultNamespace": "Si les espaces de nommage par défaut dans les ID devraient être omis. Indépendamment de ce paramètre, les espaces de nommage dans les prédicats (par exemple l'argument de sélecteur `nbt`, `execute if data`) devraient toujours être spécifiés.",
    "datapack.config.lint.nameOfNbtCompoundTagKeys": "La convention de nommage pour les clés de tags de champs dans les NBTs.",
    "datapack.config.lint.nameOfObjectives": "La convention de nommage pour les objectifs du tableau de score.",
    "datapack.config.lint.nameOfTags": "La convention de nommage pour les tags du tableau de score.",
    "datapack.config.lint.nameOfTeams": "La convention de nommage pour les équipes.",
    "datapack.config.lint.nbtArrayBracketSpacing": "Imposer l'espacement entre les crochets des tableaux NBT.",
    "datapack.config.lint.nbtArrayCommaSpacing": "Imposer l'espacement autour des virgules dans les tableaux NBT. Indépendamment des paramètres, les espaces après les virgules finales sont toujours supprimés.",
    "datapack.config.lint.nbtArrayLengthCheck": "Vérifier la longueur des tableaux NBT.",
    "datapack.config.lint.nbtArraySemicolonSpacing": "Imposer l'espacement après les points-virgules dans les tableaux NBT. Indépendamment de ce paramètre, les espaces après le point-virgule sont toujours supprimés si le tableau est vide.",
    "datapack.config.lint.nbtArrayTrailingComma": "Si il devrait il y avoir une virgule après le dernier nombre dans les tableaux NBT ou non.",
    "datapack.config.lint.nbtByteSuffix": "Le suffixe utilisé pour les TAG_Byte dans des NBTs.",
    "datapack.config.lint.nbtDoubleSuffix": "Le suffixe utilisé pour les TAG_Double dans des NBTs.",
    "datapack.config.lint.nbtFloatSuffix": "Le suffixe utilisé pour les TAG_Float dans des NBTs.",
    "datapack.config.lint.nbtLongSuffix": "Le suffixe utilisé pour les TAG_Long dans des NBTs.",
    "datapack.config.lint.nbtShortSuffix": "Le suffixe utilisé pour les TAG_Short dans des NBTs.",
    "datapack.config.lint.strictAdvancementCheck": "Si des avertissements sont donnés pour les advancements n'existant pas dans l'espace de travail.",
    "datapack.config.lint.strictBlockCheck": "Si des avertissements sont donnés pour les blocs inconnus.",
    "datapack.config.lint.strictBlockTagCheck": "Si des avertissements sont donnés pour les tags de bloc n'existant pas dans l'espace de travail.",
    "datapack.config.lint.strictBossbarCheck": "Si des avertissement sont donnés pour les bar de boss indéfinies.",
    "datapack.config.lint.strictDimensionTypeCheck": "Si des avertissement sont donnés pour les dimensions inconnues.",
    "datapack.config.lint.strictEnchantmentCheck": "Si des avertissement sont donnés pour les enchantements inconnus.",
    "datapack.config.lint.strictEntityTypeCheck": "Si des avertissement sont donnés pour les types d'entités inconnus.",
    "datapack.config.lint.strictEntityTypeTagCheck": "Si des avertissements sont donnés pour les tags de type d'entités n'existant pas dans l'espace de travail.",
    "datapack.config.lint.strictFluidCheck": "Si des avertissement sont donnés pour les fluides inconnus.",
    "datapack.config.lint.strictFluidTagCheck": "Si des avertissements sont donnés pour les tags de fluides n'existant pas dans l'espace de travail.",
    "datapack.config.lint.strictFunctionCheck": "Si des avertissements sont donnés pour les fonctions n'existant pas dans l'espace de travail.",
    "datapack.config.lint.strictFunctionTagCheck": "Si des avertissements sont donnés pour les tags de fonctions n'existant pas dans l'espace de travail.",
    "datapack.config.lint.strictItemCheck": "Si des avertissement sont donnés pour les items inconnus.",
    "datapack.config.lint.strictItemTagCheck": "Si des avertissements sont donnés pour les tags d'items n'existant pas dans l'espace de travail.",
    "datapack.config.lint.strictLootTableCheck": "Si des avertissements sont donnés pour les tables de loot n'existant pas dans l'espace de travail.",
    "datapack.config.lint.strictMobEffectCheck": "Si des avertissement sont donnés pour les effets de potion inconnus.",
    "datapack.config.lint.strictMotiveCheck": "Si des avertissement sont donnés pour les peintures inconnues.",
    "datapack.config.lint.strictObjectiveCheck": "Si des avertissement sont donnés pour les objectifs indéfinis.",
    "datapack.config.lint.strictParticleTypeCheck": "Si des avertissement sont donnés pour les types de particule inconnus.",
    "datapack.config.lint.strictPotionCheck": "Si des avertissement sont donnés pour les potions inconnues.",
    "datapack.config.lint.strictPredicateCheck": "Si des avertissements sont donnés pour les predicates n'existant pas dans l'espace de travail.",
    "datapack.config.lint.strictRecipeCheck": "Si des avertissements sont donnés pour les recettes de fabrication n'existant pas dans l'espace de travail.",
    "datapack.config.lint.strictSoundEventCheck": "Si des avertissement sont donnés pour les sons inconnus.",
    "datapack.config.lint.strictStorageCheck": "Si des avertissement sont donnés pour les storages de données indéfinis.",
    "datapack.config.lint.strictTagCheck": "Si des avertissement sont donnés pour les tags indéfinis.",
    "datapack.config.lint.strictTeamCheck": "Si des avertissement sont donnés pour les équipes indéfinies.",
    "datapack.config.lint.timeOmitTickUnit": "Si l'unité de temps des ticks (`t`) est omise dans les arguments.",
    "datapack.config.snippets": "Snippets de code.",
    "datapack.description": "Fonctionnalités de langugages lourdes pour les fichiers MCFunction.",
    "datapack.displayName": "Assistant de Datapack Plus (MCF)"
}
